# Taps
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Application Path
cask_args appdir: "/Applications"
# Binaries/Libraries
brew "git"
brew "macvim"
brew "mas"
brew "monit"
brew "neovim"
brew "wget"
brew "yarn"
brew "zsh"
brew "dart-lang/dart/dart"
# Applications
cask "alfred"
cask "android-file-transfer"
cask "android-platform-tools"
cask "android-sdk"
cask "androidtool"
cask "app-cleaner"
cask "docker"
cask "docker-toolbox"
cask "font-d2coding"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "notion"
cask "safeincloud-password-manager"
cask "slack"
cask "typora"
cask "virtualbox"
cask "visual-studio-code"
# mas
mas "LINE WORKS", id: 1029784963
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Monit", id: 1014850245
mas "Monosnap", id: 540348655
mas "OneDrive", id: 823766827
mas "Xcode", id: 497799835
mas "카카오톡", id: 869223134
# fonts
cask 'homebrew/cask-fonts/font-d2coding'
